Revit 2024 API
FaceSilhouetteNode Methods
The FaceSilhouetteNode type exposes the following members.
Methods
Name | Description
Dispose |  (Inherited from RenderNode.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetFace
 Returns the Face object corresponding to the node.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetInstanceTransform
 Returns instance transform of the object being drawn.
 (Inherited from FaceDetailNode.)
GetLinkTransform
 Returns link transform of the object being drawn.
 (Inherited from FaceDetailNode.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
FaceSilhouetteNode Class
Autodesk.Revit.DB Namespace